---
kind: method
id: M:Autodesk.Revit.DB.ValueParsingOptions.#ctor
source: html/9d305213-ddc0-7886-ae6e-abcd9fa10f66.htm
---
# Autodesk.Revit.DB.ValueParsingOptions.#ctor Method

Creates a new ValueParsingOptions object with default settings.

## Syntax (C#)
```csharp
public ValueParsingOptions()
```